docs/requests/ConsultarLoteDPS

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://www.sped.fazenda.gov.br/nfse">
   <soapenv:Header/>
   <soapenv:Body>
      <nfse:ConsultarLoteDps>
         <nfseCabecMsg>
            <cabecalho versao="1.01" xmlns="http://www.sped.fazenda.gov.br/nfse">
               <versaoDados>1.01</versaoDados>
            </cabecalho>
         </nfseCabecMsg>
         <nfseDadosMsg>
            <ConsultarLoteDpsEnvio xmlns="http://www.sped.fazenda.gov.br/nfse" xmlns:ns2="http://www.w3.org/2000/09/xmldsig#">
               <Prestador>
                  <CPF>00022623124</CPF>
                  <IM>4879-1</IM>
               </Prestador>
               <Protocolo>139E3D3C-BCF7-F011-8D75-00505699BAC5</Protocolo>
            </ConsultarLoteDpsEnvio>
         </nfseDadosMsg>
      </nfse:ConsultarLoteDps>
   </soapenv:Body>
</soapenv:Envelope>